ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GPIOC_1.0.xml
        <register id="GPIOC_GEN_EVENT0_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="DIO0" description="DIO0 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO0 in RIS register"/>
            </bitfield>
            <bitfield id="DIO1" description="DIO1 event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO1 in RIS register"/>
            </bitfield>
            <bitfield id="DIO2" description="DIO2 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO2 in RIS register"/>
            </bitfield>
            <bitfield id="DIO3" description="DIO3 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO3 in RIS register"/>
            </bitfield>
            <bitfield id="DIO4" description="DIO4 event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO4 in RIS register"/>
            </bitfield>
            <bitfield id="DIO5" description="DIO5 event" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO5 in RIS register"/>
            </bitfield>
            <bitfield id="DIO6" description="DIO6 event" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO6 in RIS register"/>
            </bitfield>
            <bitfield id="DIO7" description="DIO7 event" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO7 in RIS register"/>
            </bitfield>
            <bitfield id="DIO8" description="DIO8 event" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO8 in RIS register"/>
            </bitfield>
            <bitfield id="DIO9" description="DIO9 event" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO9 in RIS register"/>
            </bitfield>
            <bitfield id="DIO10" description="DIO10 event" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO10 in RIS register"/>
            </bitfield>
            <bitfield id="DIO11" description="DIO11 event" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO11 in RIS register"/>
            </bitfield>
            <bitfield id="DIO12" description="DIO12 event" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO12 in RIS register"/>
            </bitfield>
            <bitfield id="DIO13" description="DIO13 event" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO13 in RIS register"/>
            </bitfield>
            <bitfield id="DIO14" description="DIO14 event" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO14 in RIS register"/>
            </bitfield>
            <bitfield id="DIO15" description="DIO15 event" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="SET" value="0x1" description="Sets DIO15 in RIS register"/>
            </bitfield>
        </register>
        <register id="GPIOC_GEN_EVENT0_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="DIO0" description="DIO0 event" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO0 in RIS register"/>
            </bitfield>
            <bitfield id="DIO1" description="DIO1 event" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO1 in RIS register"/>
            </bitfield>
            <bitfield id="DIO2" description="DIO2 event" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO2 in RIS register"/>
            </bitfield>
            <bitfield id="DIO3" description="DIO3 event" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO3 in RIS register"/>
            </bitfield>
            <bitfield id="DIO4" description="DIO4 event" begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO4 in RIS register"/>
            </bitfield>
            <bitfield id="DIO5" description="DIO5 event" begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO5 in RIS register"/>
            </bitfield>
            <bitfield id="DIO6" description="DIO6 event" begin="6" end="6" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO6 in RIS register"/>
            </bitfield>
            <bitfield id="DIO7" description="DIO7 event" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO7 in RIS register"/>
            </bitfield>
            <bitfield id="DIO8" description="DIO8 event" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO8 in RIS register"/>
            </bitfield>
            <bitfield id="DIO9" description="DIO9 event" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO9 in RIS register"/>
            </bitfield>
            <bitfield id="DIO10" description="DIO10 event" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO10 in RIS register"/>
            </bitfield>
            <bitfield id="DIO11" description="DIO11 event" begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO11 in RIS register"/>
            </bitfield>
            <bitfield id="DIO12" description="DIO12 event" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO12 in RIS register"/>
            </bitfield>
            <bitfield id="DIO13" description="DIO13 event" begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO13 in RIS register"/>
            </bitfield>
            <bitfield id="DIO14" description="DIO14 event" begin="14" end="14" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO14 in RIS register"/>
            </bitfield>
            <bitfield id="DIO15" description="DIO15 event" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
                <bitenum id="CLR" value="0x1" description="Clears DIO15 in RIS register"/>
            </bitfield>
        </register>
