ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/GPIOC_1.0.xml
    <register id="GPIOC_DOE31_0" width="32" offset="0x12C0" description="Data output enable 31 to 0">
        <bitfield id="DIO0" description="Enables data output for DIO0." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO1" description="Enables data output for DIO1." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO2" description="Enables data output for DIO2." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO3" description="Enables data output for DIO3." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO4" description="Enables data output for DIO4." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO5" description="Enables data output for DIO5." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO6" description="Enables data output for DIO6." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO7" description="Enables data output for DIO7." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO8" description="Enables data output for DIO8." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO9" description="Enables data output for DIO9." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO10" description="Enables data output for DIO10." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO11" description="Enables data output for DIO11." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO12" description="Enables data output for DIO12." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO13" description="Enables data output for DIO13." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO14" description="Enables data output for DIO14." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO15" description="Enables data output for DIO15." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO16" description="Enables data output for DIO16." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO17" description="Enables data output for DIO17." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO18" description="Enables data output for DIO18." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO19" description="Enables data output for DIO19." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO20" description="Enables data output for DIO20." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO21" description="Enables data output for DIO21." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO22" description="Enables data output for DIO22." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO23" description="Enables data output for DIO23." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO24" description="Enables data output for DIO24." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO25" description="Enables data output for DIO25." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO26" description="Enables data output for DIO26." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO27" description="Enables data output for DIO27." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO28" description="Enables data output for DIO28." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO29" description="Enables data output for DIO29." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO30" description="Enables data output for DIO30." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
        <bitfield id="DIO31" description="Enables data output for DIO31." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Output disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Output enabled"/>
        </bitfield>
    </register>
    <register id="GPIOC_DOESET31_0" width="32" offset="0x12D0" description="Data output enable set 31 to 0">
        <bitfield id="DIO0" description="Writing 1 to this bit sets the DIO0 bit in the DOE31_0 register. Writing 0 has no effect." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO0 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO1" description="Writing 1 to this bit sets the DIO1 bit in the DOE31_0 register. Writing 0 has no effect." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO1 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO2" description="Writing 1 to this bit sets the DIO2 bit in the DOE31_0 register. Writing 0 has no effect." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO2 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO3" description="Writing 1 to this bit sets the DIO3 bit in the DOE31_0 register. Writing 0 has no effect." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO3 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO4" description="Writing 1 to this bit sets the DIO4 bit in the DOE31_0 register. Writing 0 has no effect." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO4 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO5" description="Writing 1 to this bit sets the DIO5 bit in the DOE31_0 register. Writing 0 has no effect." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO5 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO6" description="Writing 1 to this bit sets the DIO6 bit in the DOE31_0 register. Writing 0 has no effect." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO6 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO7" description="Writing 1 to this bit sets the DIO7 bit in the DOE31_0 register. Writing 0 has no effect." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO7 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO8" description="Writing 1 to this bit sets the DIO8 bit in the DOE31_0 register. Writing 0 has no effect." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO8 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO9" description="Writing 1 to this bit sets the DIO9 bit in the DOE31_0 register. Writing 0 has no effect." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO9 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO10" description="Writing 1 to this bit sets the DIO10 bit in the DOE31_0 register. Writing 0 has no effect." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO10 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO11" description="Writing 1 to this bit sets the DIO11 bit in the DOE31_0 register. Writing 0 has no effect." begin="11" end="11" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO11 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO12" description="Writing 1 to this bit sets the DIO12 bit in the DOE31_0 register. Writing 0 has no effect." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO12 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO13" description="Writing 1 to this bit sets the DIO13 bit in the DOE31_0 register. Writing 0 has no effect." begin="13" end="13" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO13 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO14" description="Writing 1 to this bit sets the DIO14 bit in the DOE31_0 register. Writing 0 has no effect." begin="14" end="14" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO14 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO15" description="Writing 1 to this bit sets the DIO15 bit in the DOE31_0 register. Writing 0 has no effect." begin="15" end="15" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO15 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO16" description="Writing 1 to this bit sets the DIO16 bit in the DOE31_0 register. Writing 0 has no effect." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO16 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO17" description="Writing 1 to this bit sets the DIO17 bit in the DOE31_0 register. Writing 0 has no effect." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO17 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO18" description="Writing 1 to this bit sets the DIO18 bit in the DOE31_0 register. Writing 0 has no effect." begin="18" end="18" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO18 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO19" description="Writing 1 to this bit sets the DIO19 bit in the DOE31_0 register. Writing 0 has no effect." begin="19" end="19" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO19 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO20" description="Writing 1 to this bit sets the DIO20 bit in the DOE31_0 register. Writing 0 has no effect." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO20 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO21" description="Writing 1 to this bit sets the DIO21 bit in the DOE31_0 register. Writing 0 has no effect." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO21 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO22" description="Writing 1 to this bit sets the DIO22 bit in the DOE31_0 register. Writing 0 has no effect." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO22 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO23" description="Writing 1 to this bit sets the DIO23 bit in the DOE31_0 register. Writing 0 has no effect." begin="23" end="23" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO23 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO24" description="Writing 1 to this bit sets the DIO24 bit in the DOE31_0 register. Writing 0 has no effect." begin="24" end="24" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO24 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO25" description="Writing 1 to this bit sets the DIO25 bit in the DOE31_0 register. Writing 0 has no effect." begin="25" end="25" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO25 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO26" description="Writing 1 to this bit sets the DIO26 bit in the DOE31_0 register. Writing 0 has no effect." begin="26" end="26" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO26 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO27" description="Writing 1 to this bit sets the DIO27 bit in the DOE31_0 register. Writing 0 has no effect." begin="27" end="27" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO27 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO28" description="Writing 1 to this bit sets the DIO28 bit in the DOE31_0 register. Writing 0 has no effect." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO28 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO29" description="Writing 1 to this bit sets the DIO29 bit in the DOE31_0 register. Writing 0 has no effect." begin="29" end="29" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO29 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO30" description="Writing 1 to this bit sets the DIO30 bit in the DOE31_0 register. Writing 0 has no effect." begin="30" end="30" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO30 in DOE31_0"/>
        </bitfield>
        <bitfield id="DIO31" description="Writing 1 to this bit sets the DIO31 bit in the DOE31_0 register. Writing 0 has no effect." begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="No effect"/>
            <bitenum id="SET" value="0x1" description="Sets DIO31 in DOE31_0"/>
        </bitfield>
    </register>
